Repository: JasonWenTheFox/mac-sensor-lab
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: No display identifiers, localized names, EDID blobs, or serial numbers are read.
zh_hans: 不读取显示器标识符、本地化名称、EDID 数据或序列号。

source: Only the whole-disk object associated with the current system volume is summarized.
zh_hans: 仅汇总与当前系统卷关联的整盘对象。

source: Device model, vendor, revision, serial number, GUID, UUID, BSD name, registry path, volume name, and mount path are intentionally omitted.
zh_hans: 有意省略设备型号、厂商、修订、序列号、GUID、UUID、BSD 名称、registry 路径、卷名和挂载路径。

source: SMART and NVMe health fields are not inferred from Disk Arbitration metadata.
zh_hans: 不会根据 Disk Arbitration 元数据推断 SMART 或 NVMe 健康字段。

source: No device path, identifier, model, or system error text is exported.
zh_hans: 不导出设备路径、标识符、型号或系统错误文本。

source: A shared model-class identifier, not a unique device identifier.
zh_hans: 这是同类机型共享的标识符，不是设备唯一标识。

source: A shared product-family name, not a chip identifier.
zh_hans: 这是共享的产品系列名称，不是芯片唯一标识。

source: Apple SoC family was unavailable
zh_hans: Apple SoC 系列不可用

source: Capability only; no authentication prompt or enrollment state is requested.
zh_hans: 仅检查能力；不会发起认证提示，也不会请求录入状态。

source: CPU topology was unavailable
zh_hans: CPU 拓扑不可用

source: Mac model class was unavailable
zh_hans: Mac 机型类别不可用

source: Metal GPU capabilities were unavailable
zh_hans: Metal GPU 能力不可用

source: Metal registry identifiers are intentionally not collected or exported.
zh_hans: 特意不收集或导出 Metal registry 标识符。

source: Performance and efficiency counts appear only when both bounded counters agree with the physical total.
zh_hans: 仅当性能核与能效核的受限计数之和等于物理核心总数时才显示。

source: Physical memory capacity was unavailable
zh_hans: 物理内存容量不可用

source: Secure Enclave presence is not inferred from Touch ID capability.
zh_hans: 不会根据 Touch ID 能力推断 Secure Enclave 是否存在。

source: Serial numbers, hardware UUIDs, host names, and user names are not read.
zh_hans: 不读取序列号、硬件 UUID、主机名或用户名。

source: This provider only accepts a bounded Apple M-series family name.
zh_hans: 此 Provider 只接受长度受限的 Apple M 系列名称。

source: Touch ID available
zh_hans: Touch ID 可用

source: Touch ID not detected
zh_hans: 未检测到 Touch ID

source: %lld physical • %lld logical cores
zh_hans: %lld 个物理核心 • %lld 个逻辑核心

source: Absent
zh_hans: 不存在

source: Ambient Light
zh_hans: 环境光

source: Blocked by platform
zh_hans: 受平台阻止

source: Bluetooth
zh_hans: 蓝牙

source: CPU Topology
zh_hans: CPU 拓扑

source: Camera
zh_hans: 摄像头

source: Compatibility unknown
zh_hans: 兼容性未知

source: Decoder ready
zh_hans: 解码器就绪

source: Decoder unsupported
zh_hans: 解码器不支持

source: Documented platform contract
zh_hans: 平台文档保证

source: Domain: %@ • Access: %@ • Evidence: %@
zh_hans: 领域：%@ • 访问：%@ • 证据：%@

source: External Sensors
zh_hans: 外部传感器

source: Fans
zh_hans: 风扇

source: Feature blocked
zh_hans: 功能受阻

source: Feature partial
zh_hans: 功能部分就绪

source: Feature ready
zh_hans: 功能就绪

source: Feature unsupported
zh_hans: 功能不支持

source: Fixture validated
zh_hans: 已通过样本验证

source: Hardware absent
zh_hans: 硬件不存在

source: Keyboard
zh_hans: 键盘

source: Lid
zh_hans: 上盖

source: Mac Platform
zh_hans: Mac 平台

source: Memory
zh_hans: 内存

source: Memory Hardware
zh_hans: 内存硬件

source: Mixed
zh_hans: 混合状态

source: Model identifier
zh_hans: 机型标识符

source: Motion
zh_hans: 运动

source: Network
zh_hans: 网络

source: Neural Engine
zh_hans: 神经网络引擎

source: Not applicable
zh_hans: 不适用

source: Observed on multiple models
zh_hans: 已在多款机型观察

source: Observed on one model
zh_hans: 已在一款机型观察

source: Power
zh_hans: 电源

source: Presence: %@ • Decoder: %@ • Read path: %@ • Stream: %@ • Feature: %@
zh_hans: 存在性：%@ • 解码：%@ • 读取路径：%@ • 数据流：%@ • 功能：%@

source: Present
zh_hans: 存在

source: Primary GPU
zh_hans: 主 GPU

source: Private experimental access
zh_hans: 私有实验性访问

source: Privileged helper
zh_hans: 特权辅助进程

source: Provider, channel, domain, access, status, or ID
zh_hans: Provider、通道、领域、访问、状态或 ID

source: Public API + entitlement
zh_hans: 公开 API + Entitlement

source: Public API + privacy permission
zh_hans: 公开 API + 隐私权限

source: Read path failed
zh_hans: 读取路径失败

source: Read path limited
zh_hans: 读取路径受限

source: Read path ready
zh_hans: 读取路径就绪

source: Read path unavailable
zh_hans: 读取路径不可用

source: Security Hardware
zh_hans: 安全硬件

source: SoC family
zh_hans: SoC 系列

source: Stream active
zh_hans: 数据流活跃

source: Stream inactive
zh_hans: 数据流未活跃

source: System Hardware
zh_hans: 系统硬件

source: Thermal
zh_hans: 热状态

source: Thunderbolt
zh_hans: 雷雳

source: Touch ID capability
zh_hans: Touch ID 能力

source: Trackpad
zh_hans: 触控板

source: Try a provider, channel, domain, access, status, or stable ID.
zh_hans: 尝试搜索 Provider、通道、领域、访问、状态或稳定 ID。

source: Undocumented user access
zh_hans: 未文档化的普通用户访问

source: Updated %@ • Source: %@
zh_hans: 更新于 %@ • 来源：%@

source: %@ %%/hour
zh_hans: %@ %%/小时

source: %@ h
zh_hans: %@ 小时

source: %@ and %@ recent trends
zh_hans: %@与%@的近期趋势

source: 50 MB safety limit
zh_hans: 50 MB 安全上限

source: Add Calibration Point
zh_hans: 添加校准点

source: All readings stay on this Mac unless you explicitly export a snapshot, recording, calibration, or diagnostics file.
zh_hans: 所有读数都保留在这台 Mac 上，除非你主动导出快照、记录、校准或诊断文件。

source: Automatic sampling
zh_hans: 自动采样

source: Available
zh_hans: 可用

source: Average
zh_hans: 平均

source: Average %@
zh_hans: 平均 %@

source: Battery Trend
zh_hans: 电池趋势

source: Build
zh_hans: 构建

source: Built-in demo fixtures
zh_hans: 内置演示样本

source: Calibrate at Current Raw
zh_hans: 以当前原始值校准

source: Calibrated
zh_hans: 已校准

source: Compares aggregate read and write rates without exposing device identity
zh_hans: 对比汇总读写速率，不暴露设备身份

source: Compares aggregate receive and send rates without exposing interface identity
zh_hans: 对比汇总收发速率，不暴露接口身份

source: Compares internal CPU and GPU hotspots; not ambient temperature
zh_hans: 对比内部 CPU 与 GPU 热点；不是环境温度

source: Component Thermals
zh_hans: 部件温度

source: Chart history stays in memory only and can be cleared from the toolbar.
zh_hans: 图表历史仅保留在内存中，可从工具栏清除。

source: Checking data source
zh_hans: 正在检查数据源

source: Clear
zh_hans: 清除

source: Clear All
zh_hans: 全部清除

source: Clear Chart History
zh_hans: 清除图表历史

source: Closed from reference
zh_hans: 相对参考角度已合上

source: Completed refreshes
zh_hans: 已完成刷新

source: Continuous recording
zh_hans: 连续记录

source: CSV Channels
zh_hans: CSV 通道

source: Data mode
zh_hans: 数据模式

source: Data source limited
zh_hans: 数据源受限

source: Data source ready
zh_hans: 数据源已就绪

source: Data source unavailable
zh_hans: 数据源不可用

source: Demo data — no hardware is being read
zh_hans: 演示数据 — 未读取硬件

source: Demo data — not live sensor readings
zh_hans: 演示数据 — 不是实时传感器读数

source: Derived
zh_hans: 派生

source: Derived tools unlock only when their data source is verified.
zh_hans: 只有数据源经过验证后，派生工具才会解锁。

source: Deterministic fixture readings for screenshots and UI review.
zh_hans: 用于截图和界面审查的确定性演示读数。

source: Development
zh_hans: 开发版

source: Development executable
zh_hans: 开发用可执行文件

source: Diagnostics
zh_hans: 诊断

source: Error
zh_hans: 错误

source: Errors
zh_hans: 错误

source: Estimated
zh_hans: 估算

source: Estimated illuminance
zh_hans: 估算照度

source: Estimated from %lld samples over %@ minutes; workload changes can invalidate it.
zh_hans: 依据 %lld 个样本（%@ 分钟）估算；工作负载变化可能使其失效。

source: Observed drain
zh_hans: 观察到的耗电速率

source: Projected empty
zh_hans: 预计耗尽

source: Trend estimate pauses while connected to power or charging.
zh_hans: 连接电源或充电时暂停趋势估算。

source: Uses recent public charge history; shown only while discharging
zh_hans: 使用最近的公开电量历史；仅在放电时显示

source: Waiting for at least five minutes and a measurable charge drop.
zh_hans: 正在等待至少五分钟和可测量的电量下降。

source: Every 1 second
zh_hans: 每 1 秒

source: Every %lld seconds
zh_hans: 每 %lld 秒

source: Experiments
zh_hans: 实验

source: Export
zh_hans: 导出

source: Export Calibration…
zh_hans: 导出校准…

source: Export Privacy-Safe Diagnostics…
zh_hans: 导出隐私安全诊断…

source: Hardware detected • measurement provider pending
zh_hans: 已检测到硬件 • 等待测量 Provider

source: Import Calibration…
zh_hans: 导入校准…

source: Included
zh_hans: 已包含

source: JSON Snapshot
zh_hans: JSON 快照

source: Last action
zh_hans: 上一操作

source: Last refresh
zh_hans: 上次刷新

source: Last refresh duration
zh_hans: 上次刷新耗时

source: Level
zh_hans: 水平仪

source: Lid angle
zh_hans: 上盖角度

source: Lid Protractor
zh_hans: 上盖量角器

source: Light Meter
zh_hans: 照度计

source: Limited
zh_hans: 受限

source: Live hardware
zh_hans: 实时硬件

source: Live local readings, with source and confidence kept visible.
zh_hans: 实时本地读数，始终显示数据源和可信度。

source: Loading
zh_hans: 加载中

source: Mac Sensor Lab does not request administrator access, change driver state, or bypass macOS privacy controls.
zh_hans: Mac Sensor Lab 不请求管理员权限、不改变驱动状态，也不绕过 macOS 隐私控制。

source: Max
zh_hans: 最大

source: Microphone access will be opt-in
zh_hans: 麦克风访问将始终需要主动选择

source: Min
zh_hans: 最小

source: Motion Trend
zh_hans: 运动趋势

source: No Sensors Found
zh_hans: 未找到传感器

source: No serial number, hardware UUID, UDID, host name, user name, location, process list, SSID or audio recording is collected by this build.
zh_hans: 此构建不采集序列号、硬件 UUID、UDID、主机名、用户名、位置、进程列表、SSID 或录音。

source: Not implemented • provider pending
zh_hans: 尚未实现 • 等待 Provider

source: Off
zh_hans: 已关闭

source: Opened from reference
zh_hans: 相对参考角度已张开

source: Overview
zh_hans: 概览

source: Paused
zh_hans: 已暂停

source: Pause Automatic Sampling
zh_hans: 暂停自动采样

source: Peak-to-peak
zh_hans: 峰峰值

source: Permission handling
zh_hans: 权限处理

source: Permission required
zh_hans: 需要权限

source: Position in observed raw range
zh_hans: 在已观测原始范围中的位置

source: Privacy
zh_hans: 隐私

source: Privileged
zh_hans: 需特权

source: Privacy manifest
zh_hans: 隐私清单

source: Provider error
zh_hans: Provider 错误

source: Provider health
zh_hans: Provider 健康状态

source: Public API
zh_hans: 公开 API

source: Public API + permission
zh_hans: 公开 API + 权限

source: Raw
zh_hans: 原始

source: Raw Sensors
zh_hans: 原始传感器

source: Recent data • source limited
zh_hans: 最近数据 • 数据源受限

source: Recording
zh_hans: 正在记录

source: Reference
zh_hans: 参考值

source: Reference lux
zh_hans: 参考 lux

source: Refresh
zh_hans: 刷新

source: Refresh interval
zh_hans: 刷新间隔

source: Relative change
zh_hans: 相对变化

source: Required measurement channel unavailable
zh_hans: 所需测量通道不可用

source: Resume Automatic Sampling
zh_hans: 恢复自动采样

source: Review Raw Sensors
zh_hans: 查看原始传感器

source: RMS variation
zh_hans: RMS 变化

source: Safety
zh_hans: 安全

source: Sampling
zh_hans: 采样

source: Sampling & recording
zh_hans: 采样与记录

source: Sampling controls
zh_hans: 采样控制

source: Sensor providers
zh_hans: 传感器 Provider

source: Set Current as Reference
zh_hans: 将当前值设为参考

source: Sound Lab
zh_hans: 声音实验室

source: Start Continuous CSV Recording…
zh_hans: 开始连续 CSV 记录…

source: Status changes this launch
zh_hans: 本次启动的状态变化

source: Stop Continuous Recording
zh_hans: 停止连续记录

source: Stop Recording
zh_hans: 停止记录

source: Stop continuous CSV recording
zh_hans: 停止连续 CSV 记录

source: Support
zh_hans: 支持

source: The support report contains provider status and stable channel metadata, never sensor readings, notes, source strings, machine identifiers, or file paths.
zh_hans: 支持报告只包含 Provider 状态和稳定的通道元数据，不包含传感器读数、备注、来源字符串、机器标识或文件路径。

source: This build never runs as root, changes fan settings, writes SMC values, or modifies Apple SPU driver state.
zh_hans: 此构建绝不以 root 身份运行，不改变风扇设置、不写入 SMC 值，也不修改 Apple SPU 驱动状态。

source: Trackpad Scale
zh_hans: 触控板秤

source: Try a provider, channel, source, status, or stable ID.
zh_hans: 尝试搜索 Provider、通道、来源、状态或稳定 ID。

source: Unavailable
zh_hans: 不可用

source: Undocumented
zh_hans: 未文档化

source: Undo Last Point
zh_hans: 撤销最后一点

source: Unsupported
zh_hans: 不支持

source: Update Reference
zh_hans: 更新参考值

source: Automatic sampling interval
zh_hans: 自动采样间隔

source: The interval is remembered. Pause state is intentionally reset on every launch.
zh_hans: 采样间隔会被记住；每次启动时会有意重置暂停状态。

source: Mac Sensor Lab reads sensors locally and does not request administrator access in this build.
zh_hans: Mac Sensor Lab 在本机读取传感器，此构建不请求管理员权限。

source: Live sampling attempts ordinary read-only access. If macOS denies an interface, its provider reports Permission required; this app does not request administrator access or bypass privacy controls.
zh_hans: 实时采样只尝试普通的只读访问。如果 macOS 拒绝某个接口，对应 Provider 会报告“需要权限”；本 App 不请求管理员权限，也不绕过隐私控制。

source: Automatic sampling paused
zh_hans: 已暂停自动采样

source: Automatic sampling resumed
zh_hans: 已恢复自动采样

source: Cleared in-memory chart history
zh_hans: 已清除内存中的图表历史

source: Export Sensor Snapshot
zh_hans: 导出传感器快照

source: Exported %@
zh_hans: 已导出 %@

source: Export failed: %@
zh_hans: 导出失败：%@

source: Export Privacy-Safe Diagnostics
zh_hans: 导出隐私安全诊断

source: Includes provider status and stable channel metadata, but no sensor readings or machine identifiers.
zh_hans: 包含 Provider 状态和稳定的通道元数据，但不包含传感器读数或机器标识。

source: Exported privacy-safe diagnostics %@
zh_hans: 已导出隐私安全诊断 %@

source: Diagnostics export failed: %@
zh_hans: 诊断导出失败：%@

source: Start Continuous Sensor Recording
zh_hans: 开始连续传感器记录

source: Recording is local, append-only, and stops automatically at 50 MB.
zh_hans: 记录仅保存在本地、只追加写入，并会在 50 MB 时自动停止。

source: Started recording %@
zh_hans: 已开始记录 %@

source: Could not start recording: %@
zh_hans: 无法开始记录：%@

source: Calibration point was invalid, non-monotonic, or exceeded the eight-point limit
zh_hans: 校准点无效、不单调，或超过了 8 点上限

source: Saved ambient-light calibration point %lld
zh_hans: 已保存环境光校准点 %lld

source: Removed the last ambient-light calibration point
zh_hans: 已移除最后一个环境光校准点

source: Cleared ambient-light calibration
zh_hans: 已清除环境光校准

source: Create an ambient-light calibration before exporting it
zh_hans: 请先创建环境光校准再导出

source: Export Ambient-Light Calibration
zh_hans: 导出环境光校准

source: Exported light calibration %@
zh_hans: 已导出光照校准 %@

source: Calibration export failed: %@
zh_hans: 校准导出失败：%@

source: Import Ambient-Light Calibration
zh_hans: 导入环境光校准

source: Imported light calibration %@
zh_hans: 已导入光照校准 %@

source: Calibration import failed: %@
zh_hans: 校准导入失败：%@

source: Stopped %@ after %lld rows (%@)
zh_hans: 已停止 %@，共 %lld 行（%@）

source: Recording stop failed: %@
zh_hans: 停止记录失败：%@

source: Recording stopped safely: %@
zh_hans: 记录已安全停止：%@

source: %@ experiment trend
zh_hans: %@ 实验趋势

source: %@ trend with %lld samples
zh_hans: %@ 趋势，共 %lld 个样本

source: %@ • recent samples
zh_hans: %@ • 最近样本

source: %lld changes
zh_hans: %lld 次变化

source: %lld rows • %@
zh_hans: %lld 行 • %@

source: Calculated from %lld dashboard samples. The 1–10 second cadence cannot measure vibration frequency.
zh_hans: 根据 %lld 个仪表盘样本计算。1–10 秒的采样间隔无法测量振动频率。

source: Experimental readings are not medical, legal, safety, or calibrated metrology data.
zh_hans: 实验性读数不属于医疗、法律、安全或经校准的计量数据。

source: Four uncalibrated ambient spectral channels
zh_hans: 4 个未校准的环境光谱通道

source: Linear fit from %lld points • RMSE %@ lux.
zh_hans: 由 %lld 个点线性拟合 • RMSE %@ lux。

source: Low-rate acceleration variation; not a vibration spectrum analyzer
zh_hans: 低速率加速度变化；不是振动频谱分析仪

source: Original sample time: %@
zh_hans: 原始采样时间：%@

source: Pitch %@°
zh_hans: 俯仰 %@°

source: Provider, channel, source, status, or ID
zh_hans: Provider、通道、来源、状态或 ID

source: Relative change is derived from the raw lid angle and does not alter the sensor.
zh_hans: 相对变化由原始上盖角度派生，不会更改传感器。

source: Requires a future raw Force Touch provider and calibration
zh_hans: 需要未来的 Force Touch 原始 Provider 和校准

source: Requires an external lux reference. Add up to eight strictly increasing points; every result remains an estimate, not a certified meter.
zh_hans: 需要外部 lux 参考。最多添加 8 个严格递增的点；所有结果仍是估算，不是认证照度计。

source: Roll %@°
zh_hans: 横滚 %@°

source: Shows raw light first; lux requires model-specific calibration
zh_hans: 先显示原始光照值；lux 需要特定机型的校准

source: Single-point scale: %@ lux at raw %@.
zh_hans: 单点缩放：%@ lux（原始值 %@）。

source: Source: %@
zh_hans: 来源：%@

source: Updated
zh_hans: 更新于

source: Updated %@ • Source: %@ • %@
zh_hans: 更新于 %@ • 来源：%@ • %@

source: Uses gravity-derived roll and pitch when live acceleration is available
zh_hans: 实时加速度可用时，使用由重力派生的横滚和俯仰角

source: Uses the undocumented lid-angle sensor
zh_hans: 使用未文档化的上盖角度传感器

source: macOS denied ordinary read access for %lld provider(s). Raw Sensors shows the provider-specific reason.
zh_hans: macOS 拒绝了 %lld 个 Provider 的普通只读访问。“原始传感器”会显示各 Provider 的具体原因。

source: %@ available
zh_hans: 可用空间 %@

source: %@ • %@ memory
zh_hans: %@ • %@ 内存

source: %@ • %lld active
zh_hans: %@ • %lld 台活动显示器

source: %lld active displays
zh_hans: %lld 台活动显示器

source: %lld experimental sensor types detected
zh_hans: 检测到 %lld 类实验性传感器

source: %lld of %lld capabilities detected
zh_hans: 已检测到 %lld/%lld 项能力

source: %lld read-only channels
zh_hans: %lld 个只读通道

source: AC power
zh_hans: 交流电源

source: Aggregate network counters were unavailable
zh_hans: 汇总网络计数器不可用

source: Aggregate non-idle Mach CPU ticks between consecutive samples.
zh_hans: 连续采样之间的 Mach CPU 非空闲时钟计数汇总。

source: Apple GPU performance statistics were unavailable
zh_hans: Apple GPU 性能统计不可用

source: AppleSMC is present but its user client could not be opened
zh_hans: AppleSMC 存在，但无法打开其用户客户端

source: Battery
zh_hans: 电池

source: Battery telemetry available
zh_hans: 电池遥测可用

source: Block-storage statistics were unavailable
zh_hans: 块存储统计不可用

source: CPU hotspot %@ °C
zh_hans: CPU 热点 %@ °C

source: Collecting activity baseline • %lld block devices
zh_hans: 正在建立活动基线 • %lld 个块设备

source: Collecting CPU baseline • load %@
zh_hans: 正在建立 CPU 基线 • 负载 %@

source: Collecting network baseline • %lld active interfaces
zh_hans: 正在建立网络基线 • %lld 个活动接口

source: Compatible SPU interfaces were not exposed
zh_hans: 系统未暴露兼容的 SPU 接口

source: Controller estimate; unavailable sentinel values are omitted.
zh_hans: 控制器估算值；不可用的哨兵值已省略。

source: Controller-reported capacity; it can change as the battery calibrates.
zh_hans: 控制器报告的容量；它可能随电池校准而变化。

source: Converted from the battery controller's raw deci-kelvin value.
zh_hans: 由电池控制器的原始十分之一开尔文值换算。

source: Could not read the system volume
zh_hans: 无法读取系统卷

source: Critical
zh_hans: 严重

source: Detected
zh_hans: 已检测到

source: Device names and unique identifiers are intentionally omitted.
zh_hans: 有意省略设备名称和唯一标识符。

source: Fair
zh_hans: 轻度

source: Fan %lld
zh_hans: 风扇 %lld

source: Fixed allowlisted AppleSmartBattery field.
zh_hans: 固定白名单中的 AppleSmartBattery 字段。

source: GPU memory counters available
zh_hans: GPU 内存计数器可用

source: Gravity-derived; axis orientation is model-dependent.
zh_hans: 由重力派生；坐标轴方向取决于机型。

source: HID manager could not be opened
zh_hans: 无法打开 HID 管理器

source: HID open result: %@.
zh_hans: HID 打开结果：%@。

source: Hardware/service presence only.
zh_hans: 仅表示硬件或服务存在。

source: Internal component temperature, not ambient room temperature.
zh_hans: 内部组件温度，并非室内环境温度。

source: Internal SMC telemetry; not wall-plug power.
zh_hans: 内部 SMC 遥测；并非插座侧功率。

source: Lid sensor detected but could not be opened
zh_hans: 检测到上盖传感器，但无法打开

source: Lid sensor did not return a feature report
zh_hans: 上盖传感器未返回功能报告

source: Lid sensor returned an out-of-range value
zh_hans: 上盖传感器返回了超出范围的值

source: Live %@ data
zh_hans: 实时%@数据

source: Load average (%lld min)
zh_hans: 平均负载（%lld 分钟）

source: Memory and swap counters available
zh_hans: 内存与 Swap 计数器可用

source: No
zh_hans: 否

source: No active display detected
zh_hans: 未检测到活动显示器

source: No compatible Apple SPU report devices found
zh_hans: 未发现兼容的 Apple SPU 报告设备

source: No internal battery detected
zh_hans: 未检测到内置电池

source: No known Apple SPU sensors detected
zh_hans: 未检测到已知的 Apple SPU 传感器

source: Nominal
zh_hans: 正常

source: Not detected
zh_hans: 未检测到

source: On
zh_hans: 开

source: Only a fixed %@ and generation-neutral allowlist of temperature, fan and power keys was read.
zh_hans: 仅读取固定的 %@ 与代际中立温度、风扇和功率键白名单。

source: Provider output rejected by the safety contract
zh_hans: Provider 输出被安全契约拒绝

source: Raw read-only SMC key %@; model-specific meaning.
zh_hans: 原始只读 SMC 键 %@；含义因机型而异。

source: Read %@ • Write %@
zh_hans: 读取 %@ • 写入 %@

source: Reading in the background…
zh_hans: 正在后台读取…

source: Recent live data • waiting for a new SPU report
zh_hans: 最近的实时数据 • 正在等待新的 SPU 报告

source: Reported full-charge capacity ÷ design capacity; not Apple's Battery Health status.
zh_hans: 报告满充容量 ÷ 设计容量；并非 Apple 的电池健康状态。

source: Serious
zh_hans: 较高

source: Sensors detected, but macOS is not currently publishing reports
zh_hans: 检测到传感器，但 macOS 当前未发布报告

source: Showing the last successful sample from %@ seconds ago; its original timestamp is preserved.
zh_hans: 显示 %@ 秒前最后一次成功采样；保留其原始时间戳。

source: SMC opened, but common keys returned no readings
zh_hans: SMC 已打开，但常用键没有返回读数

source: SMC opened, but the %@ key allowlist returned no readings
zh_hans: SMC 已打开，但 %@ 键白名单没有返回读数

source: Spectral channel %lld
zh_hans: 光谱通道 %lld

source: SPU enumeration failed
zh_hans: SPU 枚举失败

source: SPU interfaces are temporarily busy
zh_hans: SPU 接口暂时繁忙

source: SPU interfaces were detected but could not be opened
zh_hans: 检测到 SPU 接口，但无法打开

source: Standard lid-angle HID interface not found
zh_hans: 未找到标准上盖角度 HID 接口

source: System performance counters were unavailable
zh_hans: 系统性能计数器不可用

source: Thermal pressure %@
zh_hans: 热压力%@

source: Uncalibrated raw channel.
zh_hans: 未校准的原始通道。

source: Uncalibrated raw intensity; not asserted to be lux.
zh_hans: 未校准的原始强度；不声称单位为 lux。

source: Undocumented hardware interface; model-specific validation is required.
zh_hans: 未文档化的硬件接口；需要按机型验证。

source: Unknown
zh_hans: 未知

source: Voltage × current; not wall-plug power.
zh_hans: 电压 × 电流；并非插座侧功率。

source: Yes
zh_hans: 是

source: accelerometer
zh_hans: 加速度计

source: ambient light
zh_hans: 环境光

source: bytes
zh_hans: 字节

source: commands
zh_hans: 条命令

source: cycles
zh_hans: 次

source: data units
zh_hans: 数据单元

source: entries
zh_hans: 条

source: errors
zh_hans: 个错误

source: events
zh_hans: 次

source: gyroscope
zh_hans: 陀螺仪

source: hours
zh_hans: 小时

source: minutes
zh_hans: 分钟

source: pixels
zh_hans: 像素

source: points
zh_hans: 点

source: AGX PerformanceStatistics keys are undocumented and may change across macOS or GPU generations.
zh_hans: AGX PerformanceStatistics 键未文档化，可能随 macOS 或 GPU 代际而变化。

source: Average number of processes in the system run queue; not CPU percent.
zh_hans: 系统运行队列中的平均进程数；不是 CPU 百分比。

source: Battery-side power is not whole-system wall power.
zh_hans: 电池侧功率并非整机插座侧功率。

source: Counters aggregate active non-loopback interfaces without exporting their names or addresses.
zh_hans: 计数器汇总活动的非回环接口，不导出其名称或地址。

source: CPU generation selects an allowlist only; the brand string is not retained or exported.
zh_hans: CPU 代际仅用于选择白名单；品牌字符串不会被保留或导出。

source: CPU generation was not recognized; only fixed generation-neutral temperature, fan and power keys were read.
zh_hans: 未识别 CPU 代际；仅读取固定的代际中立温度、风扇和功率键。

source: CPU utilization needs two samples; the first read establishes a baseline.
zh_hans: CPU 利用率需要两次采样；首次读取用于建立基线。

source: Desktop Macs may not expose AppleSmartBattery.
zh_hans: 桌面 Mac 可能不暴露 AppleSmartBattery。

source: Detection does not prove continuous read permission.
zh_hans: 检测到硬件并不证明拥有连续读取权限。

source: Malformed provider output was discarded before display or export.
zh_hans: 格式异常的 Provider 输出已在显示或导出前丢弃。

source: Memory channels are raw Mach page categories and may overlap conceptually with UI labels used by other tools.
zh_hans: 内存通道是原始 Mach 页面类别，在概念上可能与其他工具的 UI 标签重叠。

source: Multiple driver instances use the maximum utilization and summed memory counters.
zh_hans: 存在多个驱动实例时，利用率取最大值，内存计数器求和。

source: No Apple SPU driver properties were changed.
zh_hans: 没有更改任何 Apple SPU 驱动属性。

source: No device names, serial numbers, volume names, or file paths are read or exported.
zh_hans: 不读取或导出设备名称、序列号、卷名称或文件路径。

source: No device names, serial numbers, volume names, or file paths are read.
zh_hans: 不读取设备名称、序列号、卷名称或文件路径。

source: No driver properties were changed and no privileged access was attempted.
zh_hans: 未更改驱动属性，也未尝试特权访问。

source: No driver state was changed and no privileged access was attempted.
zh_hans: 未更改驱动状态，也未尝试特权访问。
